EDA Report For ApplicantData

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
file_path = 'ApplicantData.xlsx'
data = pd.read_excel(file_path)

In [3]:
data.columns

Index(['App_ID', 'Country', 'University', 'Phone_Number'], dtype='object')

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37882 entries, 0 to 37881
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   App_ID        37881 non-null  object
 1   Country       37882 non-null  object
 2   University    37882 non-null  object
 3   Phone_Number  37882 non-null  object
dtypes: object(4)
memory usage: 1.2+ MB

In [5]:
data.shape

(37882, 4)

In [6]:
data.ndim

2

In [7]:
data.head()

   App_ID  Country                        University  Phone_Number
0   12345    India  Illinois Institute of Technology    9823241234
1   12345    India  Illinois Institute of Technology    8805617501
2   12345    India  Illinois Institute of Technology   18019011222
3  347397  Nigeria  Illinois Institute of Technology    7738599513
4  347397  Nigeria  Illinois Institute of Technology  919182706838

In [8]:
data.describe()

       App_ID Country                        University  Phone_Number
count   37881   37882                             37882         37882
unique  15416     856                                 1         18391
top         `   India  Illinois Institute of Technology  917506942994
freq     2676   12234                             37882            47

In [9]:
data.isna().sum()

App_ID          1
Country         0
University      0
Phone_Number    0
dtype: int64

In [12]:
df = data
df.duplicated().sum()

np.int64(16489)

In [13]:
df.drop_duplicates()

       App_ID    Country                        University  Phone_Number
0       12345      India  Illinois Institute of Technology    9823241234
1       12345      India  Illinois Institute of Technology    8805617501
2       12345      India  Illinois Institute of Technology   18019011222
3      347397    Nigeria  Illinois Institute of Technology    7738599513
4      347397    Nigeria  Illinois Institute of Technology  919182706838
...       ...        ...                               ...           ...
37877       -    Bahrain  Illinois Institute of Technology   97336598776
37878       -    Bahrain  Illinois Institute of Technology   97338787272
37879       -  australia  Illinois Institute of Technology   61432347819
37880       -    Bahrain  Illinois Institute of Technology   97335911259
37881     NaN    Bahrain  Illinois Institute of Technology   97339331888

[21393 rows x 4 columns]

       App_ID    Country                        University  Phone_Number
0       12345      India  Illinois Institute of Technology    9823241234
1       12345      India  Illinois Institute of Technology    8805617501
2       12345      India  Illinois Institute of Technology   18019011222
3      347397    Nigeria  Illinois Institute of Technology    7738599513
4      347397    Nigeria  Illinois Institute of Technology  919182706838
...       ...        ...                               ...           ...
37877       -    Bahrain  Illinois Institute of Technology   97336598776
37878       -    Bahrain  Illinois Institute of Technology   97338787272
37879       -  australia  Illinois Institute of Technology   61432347819
37880       -    Bahrain  Illinois Institute of Technology   97335911259
37881     NaN    Bahrain  Illinois Institute of Technology   97339331888

[37882 rows x 4 columns]